hotchk155/looper-test/LPC51U68_Project/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: LPC51U68
package_id: LPC51U68JBD64
mcu_data: ksdk2_0
processor_version: 7.0.1
pin_labels:
- {pin_num: '17', pin_signal: PIO1_3/FC7_SSEL2/SCT0_OUT6/FC3_SCK/CTIMER0_CAP1/USB0_UP_LED/ADC0_6, label: CODEC_RESET, identifier: CODEC_RESET}
- {pin_num: '10', pin_signal: PIO1_17/MCLK/UTICK_CAP3, label: MCLK, identifier: MCLK}
- {pin_num: '57', pin_signal: PIO1_14/FC2_RXD_SDA_MOSI/SCT0_OUT7/FC7_TXD_SCL_MISO_WS, label: SD_POWER, identifier: SD_POWER}
- {pin_num: '13', pin_signal: PIO0_31/FC2_CTS_SDA_SSEL0/CTIMER0_CAP3/CTIMER0_MAT3/ADC0_2, label: SD_CSEL, identifier: SD_CSEL}
- {pin_num: '36', pin_signal: PIO0_2/FC0_CTS_SDA_SSEL0/FC2_SSEL3, label: UI_0_IO, identifier: UI_0_IO}
- {pin_num: '37', pin_signal: PIO0_3/FC0_RTS_SCL_SSEL1/FC2_SSEL2/CTIMER1_MAT3, label: UI_1_IO, identifier: IO_1_IO;UI_1_IO}
- {pin_num: '29', pin_signal: PIO1_9/FC3_RXD_SDA_MOSI/CTIMER0_CAP2/USB0_UP_LED, label: UI_2_IO, identifier: UI_2_UI;UI_2_IO}
- {pin_num: '12', pin_signal: PIO0_30/FC1_TXD_SCL_MISO/SCT0_OUT3/CTIMER0_MAT2/CTIMER0_CAP2/ADC0_1, label: UI_LED_SINK, identifier: UI_SW_READ;UI_LED_SINK}
- {pin_num: '16', pin_signal: PIO1_2/MCLK/FC7_SSEL3/SCT0_OUT5/FC5_SSEL3/FC4_RXD_SDA_MOSI/ADC0_5, label: UI_SW_READ, identifier: UI_LED_SRC;UI_LED_SINK;UI_SW_READ}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: FLEXCOMM6, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_5/FC6_RXD_SDA_MOSI_DATA/SCT0_OUT6/CTIMER0_MAT0}
  - {pin_num: '41', peripheral: FLEXCOMM6, signal: SCK, pin_signal: PIO0_7/FC6_SCK/SCT0_OUT0/CTIMER0_MAT2/CTIMER0_CAP2}
  - {pin_num: '40', peripheral: FLEXCOMM6, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_6/FC6_TXD_SCL_MISO_WS/CTIMER0_MAT1/UTICK_CAP0}
  - {pin_num: '10', peripheral: SYSCON, signal: MCLK, pin_signal: PIO1_17/MCLK/UTICK_CAP3, direction: OUTPUT}
  - {pin_num: '27', peripheral: FLEXCOMM7, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO1_7/FC7_RXD_SDA_MOSI_DATA/CTIMER1_MAT2/CTIMER1_CAP2/ADC0_10}
  - {pin_num: '26', peripheral: FLEXCOMM7, signal: SCK, pin_signal: PIO1_6/FC7_SCK/CTIMER1_CAP2/CTIMER1_MAT2/USB0_VBUS/ADC0_9}
  - {pin_num: '28', peripheral: FLEXCOMM7, signal: TXD_SCL_MISO_WS, pin_signal: PIO1_8/FC7_TXD_SCL_MISO_WS/CTIMER1_MAT3/CTIMER1_CAP3/ADC0_11}
  - {pin_num: '17', peripheral: GPIO, signal: 'PIO1, 3', pin_signal: PIO1_3/FC7_SSEL2/SCT0_OUT6/FC3_SCK/CTIMER0_CAP1/USB0_UP_LED/ADC0_6, direction: OUTPUT}
  - {pin_num: '44', peripheral: FLEXCOMM2, signal: TXD_SCL_MISO, pin_signal: PIO0_9/FC2_TXD_SCL_MISO/SCT0_OUT2/CTIMER3_CAP0/FC3_CTS_SDA_SSEL0}
  - {pin_num: '43', peripheral: FLEXCOMM2, signal: RXD_SDA_MOSI, pin_signal: PIO0_8/FC2_RXD_SDA_MOSI/SCT0_OUT1/CTIMER0_MAT3}
  - {pin_num: '45', peripheral: FLEXCOMM2, signal: SCK, pin_signal: PIO0_10/FC2_SCK/SCT0_OUT3/CTIMER3_MAT0}
  - {pin_num: '57', peripheral: GPIO, signal: 'PIO1, 14', pin_signal: PIO1_14/FC2_RXD_SDA_MOSI/SCT0_OUT7/FC7_TXD_SCL_MISO_WS, direction: OUTPUT}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 31', pin_signal: PIO0_31/FC2_CTS_SDA_SSEL0/CTIMER0_CAP3/CTIMER0_MAT3/ADC0_2, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '7', peripheral: CTIMER0, signal: 'MATCH, 0', pin_signal: PIO1_16/CTIMER0_MAT0/CTIMER0_CAP0/FC7_RTS_SCL_SSEL1}
  - {pin_num: '18', peripheral: CTIMER0, signal: 'MATCH, 1', pin_signal: PIO1_4/FC7_RTS_SCL_SSEL1/SCT0_OUT7/FC3_TXD_SCL_MISO/CTIMER0_MAT1/ADC0_7}
  - {pin_num: '36', peripheral: GPIO, signal: 'PIO0, 2', pin_signal: PIO0_2/FC0_CTS_SDA_SSEL0/FC2_SSEL3, direction: OUTPUT, mode: inactive}
  - {pin_num: '37', peripheral: GPIO, signal: 'PIO0, 3', pin_signal: PIO0_3/FC0_RTS_SCL_SSEL1/FC2_SSEL2/CTIMER1_MAT3, identifier: UI_1_IO, direction: OUTPUT, mode: inactive}
  - {pin_num: '29', peripheral: GPIO, signal: 'PIO1, 9', pin_signal: PIO1_9/FC3_RXD_SDA_MOSI/CTIMER0_CAP2/USB0_UP_LED, identifier: UI_2_IO, direction: OUTPUT, mode: inactive}
  - {pin_num: '16', peripheral: GPIO, signal: 'PIO1, 2', pin_signal: PIO1_2/MCLK/FC7_SSEL3/SCT0_OUT5/FC5_SSEL3/FC4_RXD_SDA_MOSI/ADC0_5, identifier: UI_SW_READ, direction: INPUT,
    mode: pullDown}
  - {pin_num: '12', peripheral: GPIO, signal: 'PIO0, 30', pin_signal: PIO0_30/FC1_TXD_SCL_MISO/SCT0_OUT3/CTIMER0_MAT2/CTIMER0_CAP2/ADC0_1, identifier: UI_LED_SINK,
    direction: OUTPUT, mode: inactive}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) { /* Function assigned for the Cortex-M0P */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
  CLOCK_EnableClock(kCLOCK_Gpio0);                           /* Enables the clock for the GPIO0 port registers. 0 = Disable; 1 = Enable. */
  CLOCK_EnableClock(kCLOCK_Gpio1);                           /* Enables the clock for the GPIO1 port registers. 0 = Disable; 1 = Enable. */

  gpio_pin_config_t UI_0_IO_io_config = {                    /* PORT0 PIN2 (number: 36) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_UI_0_IO_GPIO, BOARD_INITPINS_UI_0_IO_PORT, BOARD_INITPINS_UI_0_IO_PIN, &UI_0_IO_io_config); /* Initialize GPIO functionality on pin PIO0_2 (number: 36) */
  gpio_pin_config_t UI_1_IO_io_config = {                    /* PORT0 PIN3 (number: 37) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_UI_1_IO_GPIO, BOARD_INITPINS_UI_1_IO_PORT, BOARD_INITPINS_UI_1_IO_PIN, &UI_1_IO_io_config); /* Initialize GPIO functionality on pin PIO0_3 (number: 37) */
  gpio_pin_config_t UI_LED_SINK_io_config = {                /* PORT0 PIN30 (number: 12) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_UI_LED_SINK_GPIO, BOARD_INITPINS_UI_LED_SINK_PORT, BOARD_INITPINS_UI_LED_SINK_PIN, &UI_LED_SINK_io_config); /* Initialize GPIO functionality on pin PIO0_30 (number: 12) */
  gpio_pin_config_t SD_CSEL_io_config = {                    /* PORT0 PIN31 (number: 13) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 1U
  };
  GPIO_PinInit(BOARD_INITPINS_SD_CSEL_GPIO, BOARD_INITPINS_SD_CSEL_PORT, BOARD_INITPINS_SD_CSEL_PIN, &SD_CSEL_io_config); /* Initialize GPIO functionality on pin PIO0_31 (number: 13) */
  gpio_pin_config_t UI_SW_READ_io_config = {                 /* PORT1 PIN2 (number: 16) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalInput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_UI_SW_READ_GPIO, BOARD_INITPINS_UI_SW_READ_PORT, BOARD_INITPINS_UI_SW_READ_PIN, &UI_SW_READ_io_config); /* Initialize GPIO functionality on pin PIO1_2 (number: 16) */
  gpio_pin_config_t CODEC_RESET_io_config = {                /* PORT1 PIN3 (number: 17) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_CODEC_RESET_GPIO, BOARD_INITPINS_CODEC_RESET_PORT, BOARD_INITPINS_CODEC_RESET_PIN, &CODEC_RESET_io_config); /* Initialize GPIO functionality on pin PIO1_3 (number: 17) */
  gpio_pin_config_t UI_2_IO_io_config = {                    /* PORT1 PIN9 (number: 29) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_UI_2_IO_GPIO, BOARD_INITPINS_UI_2_IO_PORT, BOARD_INITPINS_UI_2_IO_PIN, &UI_2_IO_io_config); /* Initialize GPIO functionality on pin PIO1_9 (number: 29) */
  gpio_pin_config_t SD_POWER_io_config = {                   /* PORT1 PIN14 (number: 57) GPIO configuration structure */
    .pinDirection = kGPIO_DigitalOutput,
    .outputLogic = 0U
  };
  GPIO_PinInit(BOARD_INITPINS_SD_POWER_GPIO, BOARD_INITPINS_SD_POWER_PORT, BOARD_INITPINS_SD_POWER_PIN, &SD_POWER_io_config); /* Initialize GPIO functionality on pin PIO1_14 (number: 57) */

